; domain
(define (domain melon-pina-coladas)
  (:requirements :strips :typing)

  (:types
    ingredient mixture pitcher glass refrigerator honeydew - object
  )

  (:predicates
    ;;
    (in ?item - object ?container - object)

    ;;
    (mixed ?p - pitcher)
    (chilled ?p - pitcher)
    (in_glass ?m - mixture ?g - glass)
    (garnished ?h - honeydew ?g - glass)
    (on_table ?g - glass)
    (empty ?p - pitcher)
  )

  ;;   1：
  (:action pour_ingredients_into_pitcher
    :parameters (?m - mixture ?p - pitcher ?l - object)
    :precondition (and
      (empty ?p)
      (in ?m ?l)
    )
    :effect (and
      (in ?m ?p)
      (not (empty ?p))
      (not (in ?m ?l))
    )
  )

  ;;   2：
  (:action mix_pitcher
    :parameters (?p - pitcher ?m - mixture)
    :precondition (and
      (in ?m ?p)
      (not (mixed ?p))
    )
    :effect (mixed ?p)
  )

  ;;   3：
  (:action chill_mixture
    :parameters (?p - pitcher ?r - refrigerator)
    :precondition (mixed ?p)
    :effect (chilled ?p)
  )

  ;;   4：
  (:action pour_into_glass
    :parameters (?m - mixture ?p - pitcher ?g - glass)
    :precondition (and
      (chilled ?p)
      (in ?m ?p)
    )
    :effect (and
      (in_glass ?m ?g)
      (empty ?p)
      (not (in ?m ?p))
    )
  )

  ;;   5：
  (:action add_garnish
    :parameters (?h - honeydew ?g - glass ?m - mixture)
    :precondition (in_glass ?m ?g)
    :effect (and
      (garnished ?h ?g)
      (on_table ?g)
    )
  )
)

; problem
(define (problem make-melon-pina-coladas)
  (:domain melon-pina-coladas)
  
  (:objects
    mixture1 - mixture
    pitcher1 - pitcher
    glass1 glass2 - glass
    refrigerator1 - refrigerator
    honeydew1 - honeydew
    kitchen_counter dining_table - object
  )

  (:init
    ;;
    (empty pitcher1)
    (in mixture1 kitchen_counter)
    (in pitcher1 kitchen_counter) ;
    (not (mixed pitcher1))
    (not (chilled pitcher1))
    (not (in_glass mixture1 glass1))
    (not (garnished honeydew1 glass1))
    (not (on_table glass1))
  )

  (:goal
    (and
      ;;
      (in_glass mixture1 glass1)
      (garnished honeydew1 glass1)
      (on_table glass1)
      (empty pitcher1)
    )
  )
)

; plan
1. (pour_ingredients_into_pitcher mixture1 pitcher1 kitchen_counter)
   deleted: (empty pitcher1) (in mixture1 kitchen_counter)
   added: (in mixture1 pitcher1)
   goals met: 0 of 4
2. (mix_pitcher pitcher1 mixture1)
   added: (mixed pitcher1)
   goals met: 0 of 4
3. (chill_mixture pitcher1 refrigerator1)
   added: (chilled pitcher1)
   goals met: 0 of 4
4. (pour_into_glass mixture1 pitcher1 glass1)
   deleted: (in mixture1 pitcher1)
   added: (in_glass mixture1 glass1) (empty pitcher1)
   goals met: 2 of 4
5. (add_garnish honeydew1 glass1 mixture1)
   added: (garnished honeydew1 glass1) (on_table glass1)
   goals met: 4 of 4
